Catalogs/НоменклатураСПР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НоменклатураСПР</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатураСПР/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Штрихкоды(Команда)
    ТекущаяСсылка = Элементы.Список.ТекущиеДанные;
    Если ТекущаяСсылка = Неопределено Тогда
        Предупреждение("Выберите элемент номенклатуры!");
        Возврат;
    КонецЕсли;
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("НоменклатураСПР", ТекущаяСсылка);
    ОткрытьФорму("РегистрСведений.Штрихкоды.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
    
    // Формируем данные
    ТекстДляВыгрузки = СформироватьТекстДляВыгрузкиНаСервере();
    
    // Создаем диалог выбора файла
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Заголовок = "Сохранить файл";
    Диалог.Фильтр = "Текстовые файлы (*.txt)|*.txt";
    
    // Устанавливаем имя файла по умолчанию
    ИмяФайлаПоУмолчанию = "Выгрузка_номенклатуры.txt";
    Диалог.ПолноеИмяФайла = ИмяФайлаПоУмолчанию; // Устанавливаем имя файла по умолчанию
    
    Если Диалог.Выбрать() Тогда
        ВыбранныйФайл = Диалог.ПолноеИмяФайла;
        
        Попытка
            // Определяем формат по расширению
            Расширение = нРег(Прав(ВыбранныйФайл, 4));
            
            Если Расширение = ".txt" Тогда
                СохранитьВTXT(ВыбранныйФайл, ТекстДляВыгрузки);
            КонецЕсли;
            
            Сообщить("Файл сохранен: " + ВыбранныйФайл);
        Исключение
            Сообщить("Ошибка: " + ОписаниеОшибки());
        КонецПопытки;
    КонецЕсли;
КонецПроцедуры

// Серверная функция
Функция СформироватьТекстДляВыгрузкиНаСервере()
    
    // Получаем данные из справочника НоменклатураСПР
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    НоменклатураСПР.Наименование КАК Наименование,
        |    НоменклатураСПР.ВидНоменклатуры КАК ВидНоменклатуры,
        |    НоменклатураСПР.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
        |    НоменклатураСПР.ТоварнаяГруппа КАК ТоварнаяГруппа
        |ИЗ
        |    Справочник.НоменклатураСПР КАК НоменклатураСПР";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат "";
    КонецЕсли;
    
    // Формируем заголовки
    Заголовки = "Наименование;ВидНоменклатуры;ЕдиницаИзмерения;ТоварнаяГруппа";
    Результат = Заголовки + "
    |";
    
    // Формируем строки данных
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат = Результат + 
            Строка(Выборка.Наименование) + ";" +
            Строка(Выборка.ВидНоменклатуры) + ";" +
            Строка(Выборка.ЕдиницаИзмерения) + ";" +
            Строка(Выборка.ТоварнаяГруппа) + "
    |";
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СохранитьВTXT(Путь, Данные)
    ЗаписьТекста = Новый ЗаписьТекста(Путь);
    ЗаписьТекста.ЗаписатьСтроку(Данные);
    ЗаписьТекста.Закрыть();
КонецПроцедуры
